_posts/2013-01-21-Controlling-the-format-of-printed-variables.html
---
title: Controlling the format of printed variables
date: 2013/01/21 09:00:00
updated: 2013/02/27 14:50:18
categories: python
---


<p>
This was first worked out in this <a href="http://matlab.cheme.cmu.edu/2011/10/06/sprintfing-to-the-finish/" >original Matlab post</a>.
</p>

<p>
Often you will want to control the way a variable is printed. You may want to only show a few decimal places, or print in scientific notation, or embed the result in a string. Here are some examples of printing with no control over the format.
</p>

<div class="org-src-container">

<pre class="src src-python">a = 2./3
<span style="color: #8b0000;">print</span> a
<span style="color: #8b0000;">print</span> 1/3
<span style="color: #8b0000;">print</span> 1./3.
<span style="color: #8b0000;">print</span> 10.1
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">"Avogadro's number is "</span>, 6.022e23,<span style="color: #228b22;">'.'</span>
</pre>
</div>

<pre class="example">
0.666666666667
0
0.333333333333
10.1
Avogadro's number is  6.022e+23 .
</pre>

<p>
There is no control over the number of decimals, or spaces around a printed number. 
</p>

<p>
In python, we use the format function to control how variables are printed. With the format function you use codes like {<i>n</i>:format specifier} to indicate that a formatted string should be used. <i>n</i> is the <i>n^{th}</i> argument passed to format, and there are a variety of format specifiers. Here we examine how to format float numbers. The specifier has the general form &ldquo;w.df&rdquo; where w is the width of the field, and d is the number of decimals, and f indicates a float number. &ldquo;1.3f&rdquo; means to print a float number with 3 decimal places. Here is an example.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">print</span> <span style="color: #228b22;">'The value of 1/3 to 3 decimal places is {0:1.3f}'</span>.format(1./3.)
</pre>
</div>

<pre class="example">
The value of 1/3 to 3 decimal places is 0.333
</pre>

<p>
In that example, the 0 in {0:1.3f} refers to the first (and only) argument to the format function. If there is more than one argument, we can refer to them like this:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">print</span> <span style="color: #228b22;">'Value 0 = {0:1.3f}, value 1 = {1:1.3f}, value 0 = {0:1.3f}'</span>.format(1./3., 1./6.)
</pre>
</div>

<pre class="example">
Value 0 = 0.333, value 1 = 0.167, value 0 = 0.333
</pre>

<p>
Note you can refer to the same argument more than once, and in arbitrary order within the string.
</p>

<p>
Suppose you have a list of numbers you want to print out, like this:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">for</span> x <span style="color: #8b0000;">in</span> [1./3., 1./6., 1./9.]:
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'The answer is {0:1.2f}'</span>.format(x)
</pre>
</div>

<pre class="example">
The answer is 0.33
The answer is 0.17
The answer is 0.11
</pre>

<p>
The &ldquo;g&rdquo; format specifier is a general format that can be used to indicate a precision, or to indicate significant digits. To print a number with a specific number of significant digits we do this:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0:1.3g}'</span>.format(1./3.)
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0:1.3g}'</span>.format(4./3.)
</pre>
</div>

<pre class="example">
0.333
1.33
</pre>

<p>
We can also specify plus or minus signs. Compare the next two outputs.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">for</span> x <span style="color: #8b0000;">in</span> [-1., 1.]: 
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0:1.2f}'</span>.format(x)
</pre>
</div>

<pre class="example">
-1.00
1.00
</pre>

<p>
You can see the decimals do not align. That is because there is a minus sign in front of one number. We can specify to show the sign for positive and negative numbers, or to pad positive numbers to leave space for positive numbers.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">for</span> x <span style="color: #8b0000;">in</span> [-1., 1.]: 
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0:+1.2f}'</span>.format(x) <span style="color: #ff0000; font-weight: bold;"># explicit sign</span>

<span style="color: #8b0000;">for</span> x <span style="color: #8b0000;">in</span> [-1., 1.]: 
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0: 1.2f}'</span>.format(x) <span style="color: #ff0000; font-weight: bold;"># pad positive numbers</span>
</pre>
</div>

<pre class="example">
-1.00
+1.00
-1.00
 1.00
</pre>

<p>
We use the &ldquo;e&rdquo; or &ldquo;E&rdquo; format modifier to specify scientific notation.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
eps = np.finfo(np.double).eps
<span style="color: #8b0000;">print</span> eps
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0}'</span>.format(eps)
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0:1.2f}'</span>.format(eps)
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0:1.2e}'</span>.format(eps)  <span style="color: #ff0000; font-weight: bold;">#exponential notation</span>
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0:1.2E}'</span>.format(eps)  <span style="color: #ff0000; font-weight: bold;">#exponential notation with capital E</span>
</pre>
</div>

<pre class="example">
2.22044604925e-16
2.22044604925e-16
0.00
2.22e-16
2.2E-16
</pre>

<p>
As a float with 2 decimal places, that very small number is practically equal to 0.
</p>

<p>
We can even format percentages. Note you do not need to put the % in your string.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">print</span> <span style="color: #228b22;">'the fraction {0} corresponds to {0:1.0%}'</span>.format(0.78)
</pre>
</div>

<pre class="example">
the fraction 0.78 corresponds to 78%
</pre>

<p>
There are many other options for formatting strings. See <a href="http://docs.python.org/2/library/string.html#formatstrings" >http://docs.python.org/2/library/string.html#formatstrings</a> for a full specification of the options.
</p>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/01/21/Controlling-the-format-of-printed-variables.org">org-mode source</a><p>